In [1]:
# импортируем библиотеки numpy и pandas
import numpy as np
import pandas as pd

# импортируем библиотеку datetime для работы с датами
import datetime
from datetime import datetime, date

# импортируем matplotlib для построения графиков
import matplotlib.pyplot as plt

### Обработка данных, устранение аномалий (дубликаты, пропущенные данные)

[Оригинал статьи Хэдли Уикхэма](https://vita.had.co.nz/papers/tidy-data.pdf) про аккуратные данные (**data tidying**) 

В аккуратных данных нет сюрпризов и их можно использовать для анализа.

### Работа с пропущенными данными

[Официальная документация](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html)

Данные являются пропущенными (missing), если они содержат значение `NaN` (или `np.nan`).

In [2]:
# создаем датафрейм с 5 строками и 3 столбцами
df = pd.DataFrame(np.arange(0, 15).reshape(5, 3), 
               index=['a', 'b', 'c', 'd', 'e'], 
               columns=['c1', 'c2', 'c3'])
df

   c1  c2  c3
a   0   1   2
b   3   4   5
c   6   7   8
d   9  10  11
e  12  13  14

In [3]:
# добавляем несколько столбцов и строк в датафрейм
# столбец c4 со значениями NaN
df['c4'] = np.nan
# строка 'f' со значениями от 15 до 18 
df.loc['f'] = np.arange(15, 19) 
# строка 'g', состоящая из значений NaN
df.loc['g'] = np.nan
# столбец 'C5', состоящий из значений NaN
df['c5'] = np.nan
# меняем значение в столбце 'c4' строки 'a'
df['c4']['a'] = 20
df

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   NaN   NaN   NaN   NaN NaN

### Поиск значений NaN в объектах библиотеки pandas

In [4]:
# какие элементы являются значениями NaN?
df.isnull()

      c1     c2     c3     c4    c5
a  False  False  False  False  True
b  False  False  False   True  True
c  False  False  False   True  True
d  False  False  False   True  True
e  False  False  False   True  True
f  False  False  False  False  True
g   True   True   True   True  True

In [5]:
# подсчитываем количество значений NaN в каждом столбце
df.isnull().sum() # где True == 1

c1    1
c2    1
c3    1
c4    5
c5    7
dtype: int64

In [6]:
# вычисляем общее количество значений NaN
df.isnull().sum().sum()

15

In [7]:
# вычисляем количество значений, отличных от NaN, по каждому столбцу
df.count()

c1    6
c2    6
c3    6
c4    2
c5    0
dtype: int64

In [8]:
# этот программный код тоже подсчитывает 
# общее количество значений NaN
(len(df) - df.count()).sum()

15

In [9]:
# какие элементы являются непропущенными значениями?
df.notnull()

      c1     c2     c3     c4     c5
a   True   True   True   True  False
b   True   True   True  False  False
c   True   True   True  False  False
d   True   True   True  False  False
e   True   True   True  False  False
f   True   True   True   True  False
g  False  False  False  False  False

### Удаление пропущенных данных

In [10]:
# отбираем непропущенные значения в столбце c4
df.c4[df.c4.notnull()]

a    20.0
f    18.0
Name: c4, dtype: float64

.dropna() также возвращает непропущенные значения этот программный код извлекает в столбце c4 все значения, кроме значений NaN

In [11]:
df.c4.dropna()

a    20.0
f    18.0
Name: c4, dtype: float64

.dropna() возвращает копию с удаленными значениями, исходный датафрейм/столбец не изменился:

In [12]:
df.c4

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

Метод .dropna() при применении к датафрейму удаляет целиком строки, в которых есть по крайней мере одно значение NaN.

В данном случае будут удалены все строки:

In [13]:
df.dropna()

Empty DataFrame
Columns: [c1, c2, c3, c4, c5]
Index: []

Используя параметр how='all', удаляем лишь те строки, в которых все значения являются значениями NaN:

In [14]:
df.dropna(how='all')

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN

Меняем ось, чтобы удалить столбцы со значениями NaN вместо строк:

In [15]:
df.dropna(how='all', axis=1) # попрощаемся со столбцом c5

     c1    c2    c3    c4
a   0.0   1.0   2.0  20.0
b   3.0   4.0   5.0   NaN
c   6.0   7.0   8.0   NaN
d   9.0  10.0  11.0   NaN
e  12.0  13.0  14.0   NaN
f  15.0  16.0  17.0  18.0
g   NaN   NaN   NaN   NaN

In [16]:
df2 = df.copy()

# заменяем две ячейки с пропусками значениями 0
df2.loc['g'].c1 = 0
df2.loc['g'].c3 = 0
df2

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0   NaN NaN
c   6.0   7.0   8.0   NaN NaN
d   9.0  10.0  11.0   NaN NaN
e  12.0  13.0  14.0   NaN NaN
f  15.0  16.0  17.0  18.0 NaN
g   0.0   NaN   0.0   NaN NaN

In [17]:
# а сейчас удаляем столбцы, в которых есть хотя бы одно значение NaN
df2.dropna(how='any', axis=1)

     c1    c3
a   0.0   2.0
b   3.0   5.0
c   6.0   8.0
d   9.0  11.0
e  12.0  14.0
f  15.0  17.0
g   0.0   0.0

In [18]:
# удаляем лишь те столбцы, в которых по меньшей мере 5 значений NaN
df.dropna(thresh=5, axis=1) # inplace=False

     c1    c2    c3
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   6.0   7.0   8.0
d   9.0  10.0  11.0
e  12.0  13.0  14.0
f  15.0  16.0  17.0
g   NaN   NaN   NaN

### Обработка значений NaN в ходе арифметических операций

Значения NaN обрабатываются в pandas не так, как в NumPy:

In [19]:
# создаем массив NumPy с одним значением NaN
a = np.array([1, 2, np.nan, 3])

# создаем объект Series из массива
s = pd.Series(a)

# средние значения массива и серии отличаются
a.mean(), s.mean()

(nan, 2.0)

Показываем, как методы .sum(), .mean() и .cumsum()  обрабатывают значения NaN на примере столбца c4 датафрейма df:

In [20]:
s = df.c4
s.sum(), # значения NaN обработаны как 0

(38.0,)

In [21]:
s.mean() # NaN также обработаны как 0

19.0

В методе .cumsum() значения NaN тоже обрабатываются как 0,  но в итоговом объекте Series значения NaN сохраняются:

In [22]:
s.cumsum()

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    38.0
g     NaN
Name: c4, dtype: float64

При выполнении арифметических операциий значение NaN будет перенесено в результат

In [23]:
df.c4 + 1

a    21.0
b     NaN
c     NaN
d     NaN
e     NaN
f    19.0
g     NaN
Name: c4, dtype: float64

### Заполнение пропущенных данных

In [24]:
# возвращаем новый датафрейм, в котором значения NaN заполнены нулями
filled = df.fillna(0)
filled

     c1    c2    c3    c4   c5
a   0.0   1.0   2.0  20.0  0.0
b   3.0   4.0   5.0   0.0  0.0
c   6.0   7.0   8.0   0.0  0.0
d   9.0  10.0  11.0   0.0  0.0
e  12.0  13.0  14.0   0.0  0.0
f  15.0  16.0  17.0  18.0  0.0
g   0.0   0.0   0.0   0.0  0.0

In [25]:
# значения NaN не учитываются при вычислении средних значений
df.mean()

c1     7.5
c2     8.5
c3     9.5
c4    19.0
c5     NaN
dtype: float64

In [26]:
# после замены значений NaN на 0 получим другие средние значения
filled.mean()

c1    6.428571
c2    7.285714
c3    8.142857
c4    5.428571
c5    0.000000
dtype: float64

### Прямое и обратное заполнение пропущенных значений

Заполняем пропуски в столбце c4 датафрейма df в прямом порядке, метод последнего известного значения:

In [27]:
df.c4

a    20.0
b     NaN
c     NaN
d     NaN
e     NaN
f    18.0
g     NaN
Name: c4, dtype: float64

In [28]:
df.c4.fillna(method="ffill")

a    20.0
b    20.0
c    20.0
d    20.0
e    20.0
f    18.0
g    18.0
Name: c4, dtype: float64

In [29]:
# выполняем обратное заполнение
df.c4.fillna(method="bfill")

a    20.0
b    18.0
c    18.0
d    18.0
e    18.0
f    18.0
g     NaN
Name: c4, dtype: float64

### Заполнение с помощью меток индекса

In [30]:
# создаем новую серию значений, которую используем
# для заполнения значений NaN там, 
# где метки индекса будут совпадать
fill_values = pd.Series([100, 101, 102], index=['a', 'e', 'g'])
fill_values

a    100
e    101
g    102
dtype: int64

In [31]:
# заполняем пропуски в столбце c4 с помощью fill_values
# a, e и g будут заполнены, поскольку метки совпали,
# однако значение a не изменится, потому что оно 
# не является пропуском
df.c4.fillna(fill_values)

a     20.0
b      NaN
c      NaN
d      NaN
e    101.0
f     18.0
g    102.0
Name: c4, dtype: float64

In [32]:
# заполняем значения NaN в каждом столбце 
# средним значением этого столбца
df.fillna(df.mean())

     c1    c2    c3    c4  c5
a   0.0   1.0   2.0  20.0 NaN
b   3.0   4.0   5.0  19.0 NaN
c   6.0   7.0   8.0  19.0 NaN
d   9.0  10.0  11.0  19.0 NaN
e  12.0  13.0  14.0  19.0 NaN
f  15.0  16.0  17.0  18.0 NaN
g   7.5   8.5   9.5  19.0 NaN

### Интерполяция пропущенных значений

In [33]:
# выполняем линейную интерполяцию значений NaN с 1 по 2
s = pd.Series([1, np.nan, np.nan, np.nan, 2])
s.interpolate()

0    1.00
1    1.25
2    1.50
3    1.75
4    2.00
dtype: float64

In [34]:
# создаем временной ряд, но при этом значение
# по одной дате будет пропущено
ts = pd.Series([1, np.nan, 2], 
                index=[datetime(2014, 1, 1), 
                       datetime(2014, 2, 1),                   
                       datetime(2014, 4, 1)])
ts

2014-01-01    1.0
2014-02-01    NaN
2014-04-01    2.0
dtype: float64

In [35]:
# выполняем линейную интерполяцию на основе
# количества элементов в данной серии
ts.interpolate()

2014-01-01    1.0
2014-02-01    1.5
2014-04-01    2.0
dtype: float64

In [36]:
# этот программный код учитывает тот факт,
# что у нас отсутствует запись для 2014-03-01
ts.interpolate(method="time")

2014-01-01    1.000000
2014-02-01    1.344444
2014-04-01    2.000000
dtype: float64

In [37]:
# создаем объект Series, чтобы продемонстрировать интерполяцию,
# основанную на индексных метках
s = pd.Series([0, np.nan, 100], index=[0, 1, 10])
s

0       0.0
1       NaN
10    100.0
dtype: float64

In [38]:
# выполняем линейную интерполяцию
s.interpolate()

0       0.0
1      50.0
10    100.0
dtype: float64

In [39]:
# выполняем интерполяцию на основе значений индекса
s.interpolate(method="values")

0       0.0
1      10.0
10    100.0
dtype: float64

### Обработка дублирующихся данных

In [40]:
# создаем датафрейм с дублирующимися строками
data = pd.DataFrame({'a': ['x'] * 3 + ['y'] * 4, 
                     'b': [1, 1, 2, 3, 3, 4, 4]})
data

   a  b
0  x  1
1  x  1
2  x  2
3  y  3
4  y  3
5  y  4
6  y  4

In [41]:
# определяем, какие строки являются дублирующимися,
# то есть какие строки уже ранее встречались в датафрейме
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [42]:
# удаляем дублирующиеся строки, каждый раз оставляя 
# первое из дублирующихся наблюдений
data.drop_duplicates()

   a  b
0  x  1
2  x  2
3  y  3
5  y  4

In [43]:
# удаляем дублирующиеся строки, каждый раз оставляя 
# последнее из дублирующихся наблюдений
data.drop_duplicates(keep='last')

   a  b
1  x  1
2  x  2
4  y  3
6  y  4

In [44]:
# добавляем столбец c со значениями от 0 до 6
# метод .duplicated() сообщает об отсутствии
# дублирующихся строк
data['c'] = range(7)
data

   a  b  c
0  x  1  0
1  x  1  1
2  x  2  2
3  y  3  3
4  y  3  4
5  y  4  5
6  y  4  6

In [45]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [46]:
# но если мы укажем, что нужно удалить дублирующиеся строки
# с учетом значений в столбцах a и b,
# результаты будут выглядеть так
data.drop_duplicates(['a', 'b'])

   a  b  c
0  x  1  0
2  x  2  2
3  y  3  3
5  y  4  5

### Сопоставление значений другим значениям

In [47]:
# создаем два объекта Series для иллюстрации 
# процесса сопоставления значений
x = pd.Series({"one": 1, "two": 2, "three": 3})
y = pd.Series({1: "a", 2: "b", 3: "c"})

In [48]:
x

one      1
two      2
three    3
dtype: int64

In [49]:
y

1    a
2    b
3    c
dtype: object

In [50]:
# сопоставляем значения серии x значениям серии y 
x.map(y)

one      a
two      b
three    c
dtype: object

In [51]:
# если между значением серии y и индексной меткой серии x 
# не будет найдено соответствие, будет выдано значение NaN
x = pd.Series({"one": 1, "two": 2, "three": 3})
x

one      1
two      2
three    3
dtype: int64

In [52]:
y = pd.Series({1: "a", 2: "b"})
y

1    a
2    b
dtype: object

In [53]:
x.map(y)

one        a
two        b
three    NaN
dtype: object

### Замена значений

In [54]:
# создаем объект Series, чтобы проиллюстрировать 
# метод .replace()
s = pd.Series([0., 1., 2., 3., 2., 4.])
s

0    0.0
1    1.0
2    2.0
3    3.0
4    2.0
5    4.0
dtype: float64

In [55]:
# заменяем значение, соответствующее 
# индексной метке 2, на значение 5
s.replace(2, 5)

0    0.0
1    1.0
2    5.0
3    3.0
4    5.0
5    4.0
dtype: float64

In [56]:
# заменяем все элементы новыми значениями
s.replace([0, 1, 2, 3, 4], [4, 3, 2, 1, 0])

0    4.0
1    3.0
2    2.0
3    1.0
4    2.0
5    0.0
dtype: float64

In [57]:
# заменяем элементы, используя словарь
s.replace({0: 10, 1: 100})

0     10.0
1    100.0
2      2.0
3      3.0
4      2.0
5      4.0
dtype: float64

In [58]:
# создаем датафрейм с двумя столбцами
df = pd.DataFrame({'a': [0, 1, 2, 3, 4], 'b': [5, 6, 7, 8, 9]})
df

   a  b
0  0  5
1  1  6
2  2  7
3  3  8
4  4  9

In [59]:
# задаем разные заменяемые значения для каждого столбца
df.replace({'a': 1, 'b': 8}, 100)

     a    b
0    0    5
1  100    6
2    2    7
3    3  100
4    4    9

In [60]:
# иллюстрируем замену значений с помощью метода pad
# заменяем первое значение на 10
s[0] = 10
s

0    10.0
1     1.0
2     2.0
3     3.0
4     2.0
5     4.0
dtype: float64

In [61]:
# заменяем элементы с индексными метками 1, 2, 3, используя
# для заполнения самое последнее значение, предшествующее
# заданным меткам (10)
s.replace([1, 2, 3], method='pad')

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
5     4.0
dtype: float64

### Применение функций для преобразования данных

In [62]:
# иллюстрируем применение функции к каждому
# элементу объекта Series
s = pd.Series(np.arange(5))
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [63]:
s.apply(lambda v: v * 2)

0    0
1    2
2    4
3    6
4    8
dtype: int64

In [64]:
# создаем датафрейм, чтобы проиллюстрировать применение 
# операции суммирования к каждому столбцу
df = pd.DataFrame(np.arange(12).reshape(4, 3), 
                  columns=['a', 'b', 'c'])
df

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [65]:
# вычисляем сумму элементов в каждом столбце
df.apply(lambda col: col.sum())

a    18
b    22
c    26
dtype: int64

In [66]:
# вычисляем сумму элементов в каждой строке
df.apply(lambda row: row.sum(), axis=1)

0     3
1    12
2    21
3    30
dtype: int64

Результат операции удобно добавить в качестве нового столбца:

In [67]:
# создаем столбец 'interim' путем умножения столбцов a и b
df['interim'] = df.apply(lambda r: r.a * r.b, axis=1)
df

   a   b   c  interim
0  0   1   2        0
1  3   4   5       12
2  6   7   8       42
3  9  10  11       90

In [68]:
# а теперь получаем столбец 'result' путем сложения
# столбцов 'interim' и 'c'
df['result'] = df.apply(lambda r: r.interim + r.c, axis=1)
df

   a   b   c  interim  result
0  0   1   2        0       2
1  3   4   5       12      17
2  6   7   8       42      50
3  9  10  11       90     101

In [69]:
# заменяем значения столбца a на сумму значений по строке
df.a = df.a + df.b + df.c
df

    a   b   c  interim  result
0   3   1   2        0       2
1  12   4   5       12      17
2  21   7   8       42      50
3  30  10  11       90     101

In [70]:
# создаем объект DataFrame из 3 строк и 5 столбцов
# только вторая строка содержит значение NaN
df = pd.DataFrame(np.arange(0, 15).reshape(3, 5))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [71]:
df.loc[1, 2] = np.nan
df

    0   1     2   3   4
0   0   1   2.0   3   4
1   5   6   NaN   8   9
2  10  11  12.0  13  14

In [72]:
# демонстрируем применение функции только к тем строкам,
# в которых нет значений NaN
df.dropna().apply(lambda x: x.sum(), axis=1)

0    10.0
2    60.0
dtype: float64

In [73]:
# используем метод .applymap(), чтобы изменить формат 
# всех элементов объекта DataFrame
df.applymap(lambda x: '%.2f' % x)

       0      1      2      3      4
0   0.00   1.00   2.00   3.00   4.00
1   5.00   6.00    nan   8.00   9.00
2  10.00  11.00  12.00  13.00  14.00